RRRecruit/interview-vol2-db.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-26 周二 01:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SQL面试45题</title>
<meta name="generator" content="Org mode">
<meta name="author" content="unname">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">SQL面试45题</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2dec9d1">1. 查询Student表中的所有记录的Sname、Ssex和Class列</a></li>
<li><a href="#org9aec7bd">2. 查询教师所有的单位即不重复的Depart列。（多练）</a></li>
<li><a href="#org4dcc839">3. 查询Student表的所有记录</a></li>
<li><a href="#org46a6b07">4. 查询Score表中成绩在60到80之间的所有记录</a></li>
<li><a href="#org51af733">5. 查询Score表中成绩为85，86或88的记录</a></li>
<li><a href="#org8d98d79">6. 查询Student表中“95031”班或性别为“女”的同学记录</a></li>
<li><a href="#org943e006">7. 以Class降序查询Student表的所有记录</a></li>
<li><a href="#org1a22978">8. 以Cno升序、Degree降序查询Score表的所有记录</a></li>
<li><a href="#org453cb7c">9. 查询“95031”班的学生人数</a></li>
<li><a href="#org10e895b">10. 查询Score表中的最高分的学生学号和课程号。（子查询或者排序）</a></li>
<li><a href="#orgf666123">11. 查询每门课的平均成绩。(group by:根据Cno进行分组)</a></li>
<li><a href="#org696da58">12. 查询Score表中至少有5名学生选修的并以3开头的课程的平均分数</a></li>
<li><a href="#orgac2f19c">13. 查询分数大于70，小于90的Sno列</a></li>
<li><a href="#orgdb92105">14. 查询所有学生的Sname、Cno和Degree列</a></li>
<li><a href="#orga1a7075">15. 查询所有学生的Sno、Cname和Degree列</a></li>
<li><a href="#orgb7be05f">16. 查询所有学生的Sname、Cname和Degree列</a></li>
<li><a href="#orgfc72885">17. 查询“95033”班学生的平均分。(子查询or条件查询)</a></li>
<li><a href="#org5126c59">18. 假设使用如下命令建立了一个grade表</a></li>
<li><a href="#org089abc5">19. 现查询所有同学的Sno、Cno和rank列。(between选取两个值之间的数据范围)</a></li>
<li><a href="#org16b0d38">20. 查询选修“3-105”课程的成绩高于“109”号同学成绩的所有同学的记录</a></li>
<li><a href="#org1617588">21. 查询score中选学多门课程的同学中分数为非最高分成绩的记录</a></li>
<li><a href="#orge3963fc">22. 查询成绩高于学号为“109”、课程号为“3-105”的成绩的所有记录</a></li>
<li><a href="#org7f0715d">23. 查询和学号为107的同学同年出生的所有学生的Sno、Sname和Sbirthday列</a></li>
<li><a href="#org591fcd2">24. 查询“张旭“教师任课的学生成绩</a></li>
<li><a href="#orgd033219">25. 查询选修某课程的同学人数多于5人的教师姓名</a></li>
<li><a href="#orgd1af653">26. 查询95033班和95031班全体学生的记录</a></li>
<li><a href="#org1a6d7ca">27. 查询存在有85分以上成绩的课程Cno</a></li>
<li><a href="#orga79c5b3">28. 查询出“计算机系“教师所教课程的成绩表</a></li>
<li><a href="#org70abc62">29. 查询“计算机系”与“电子工程系“不同职称的教师的Tname和Prof。使用相关子查询</a></li>
<li><a href="#orge52afbe">30. 查询选修编号为“3-105“课程且成绩至少高于选修编号为“3-245”课程的同学的Cno、Sno和Degree,并按Degree从高到低次序排序</a></li>
<li><a href="#org947a46b">31. 查询选修编号为“3-105”课程且成绩高于选修编号为“3-245”课程的同学的Cno、Sno和Degree.</a></li>
<li><a href="#orgff8970b">32. 查询所有教师和同学的name、sex和birthday</a></li>
<li><a href="#orgaf384f2">33. 查询所有“女”教师和“女”同学的name、sex和birthday.</a></li>
<li><a href="#org9d1f036">34. 查询成绩比该课程平均成绩低的同学的成绩表</a></li>
<li><a href="#org3b848fe">35. 查询所有任课教师的Tname和Depart</a></li>
<li><a href="#orgf0e1501">36. 查询所有未讲课的教师的Tname和Depart</a></li>
<li><a href="#orgfc149af">37. 查询至少有2名男生的班号</a></li>
<li><a href="#org845fb02">38. 查询Student表中不姓“王”的同学记录</a></li>
<li><a href="#org3b323da">39. 查询Student表中每个学生的姓名和年龄</a></li>
<li><a href="#orga2c4ecb">40. 查询Student表中最大和最小的Sbirthday日期值</a></li>
<li><a href="#orgab33403">41. 以班号和年龄从大到小的顺序查询Student表中的全部记录</a></li>
<li><a href="#org2e51169">42. 查询“男”教师及其所上的课程</a></li>
<li><a href="#orgabd5db8">43. 查询最高分同学的Sno、Cno和Degree列</a></li>
<li><a href="#org9559dc6">44. 查询和“李军”同性别的所有同学的Sname.</a></li>
<li><a href="#orga8b1b5f">45. 查询和“李军”同性别并同班的同学Sname</a></li>
<li><a href="#org27b36b7">46. 查询所有选修“计算机导论”课程的“男”同学的成绩表</a></li>
</ul>
</div>
</nav>
<blockquote>
<p>
由成胜文提供！
</p>
</blockquote>


<p>
SQL:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> database  school;
use school;

#&#23398;&#29983;&#34920;
<span class="org-keyword">create</span> <span class="org-keyword">table</span> `Student`
(
  `Sno` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#20154;&#21517;'</span>,
  `Sname` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#22995;&#21517;'</span>,
  `Ssex` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#24615;&#21035;'</span>,
  `Sbirthday` datetime COMMENT <span class="org-string">'&#20986;&#29983;&#26085;&#26399;'</span>,
  `<span class="org-keyword">Class</span>` <span class="org-type">varchar</span>(20) COMMENT <span class="org-string">'&#29677;&#32423;'</span>
);
#&#35838;&#31243;&#34920;
<span class="org-keyword">create</span> <span class="org-keyword">table</span> `Course`(
  `Cno` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#35838;&#31243;&#21495;'</span>,
  `Cname` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#35838;&#31243;&#21517;&#31216;'</span>,
  `Tno` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#25945;&#24037;&#32534;&#21495;'</span>
);
#&#25104;&#32489;&#34920;
<span class="org-keyword">Create</span> <span class="org-keyword">table</span> `Score` (
  `Sno` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#23398;&#21495;'</span>,
  `Cno` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">NULL</span> comment <span class="org-string">'&#35838;&#31243;&#21495;'</span>,
  `Degree` <span class="org-type">DECIMAL</span>(4,1) <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#25104;&#32489;'</span>
);
#&#25945;&#24072;&#34920;
<span class="org-keyword">create</span> <span class="org-keyword">table</span> `Teacher` (
  `Tno` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#25945;&#24037;&#32534;&#21495;'</span>,
  `Tname` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#25945;&#24037;&#22995;&#21517;'</span>,
  `Tsex` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#25945;&#24037;&#24615;&#21035;'</span>,
  `Tbirthday` datetime <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#25945;&#24037;&#20986;&#29983;&#26085;&#26399;'</span>,
  `Prof` <span class="org-type">varchar</span>(20) <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#32844;&#31216;'</span>,
  `Depart` <span class="org-type">varchar</span>(20) <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#25945;&#24037;&#25152;&#22312;&#37096;&#38376;'</span>
);

<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `Student` <span class="org-keyword">value</span>
(108,<span class="org-string">'&#26366;&#21326;'</span>,<span class="org-string">'&#30007;'</span>,<span class="org-string">'1977-09-01'</span>,95033),
(105,<span class="org-string">'&#21281;&#26126;'</span>,<span class="org-string">'&#30007;'</span>,<span class="org-string">'1975-10-02'</span>,95031),
(107,<span class="org-string">'&#29579;&#20029;'</span>,<span class="org-string">'&#22899;'</span>,<span class="org-string">'1976-01-23'</span>,95033),
(101,<span class="org-string">'&#26446;&#20891;'</span>,<span class="org-string">'&#30007;'</span>,<span class="org-string">'1976-02-20'</span>,95033),
(109,<span class="org-string">'&#29579;&#33459;'</span>,<span class="org-string">'&#22899;'</span>,<span class="org-string">'1975-02-10'</span>,95031),
(103,<span class="org-string">'&#38470;&#20891;'</span>,<span class="org-string">'&#30007;'</span>,<span class="org-string">'1974-06-03'</span>,95031);

<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `Course` <span class="org-keyword">value</span>
(3-105,<span class="org-string">'&#35745;&#31639;&#26426;&#23548;&#35770;'</span>,825),
(3-245,<span class="org-string">'&#25805;&#20316;&#31995;&#32479;'</span>,804),
(6-166,<span class="org-string">'&#25968;&#23383;&#30005;&#36335;'</span>,856),
(9-888,<span class="org-string">'&#39640;&#31561;&#25968;&#23398;'</span>,831);

<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `Score` <span class="org-keyword">value</span>
(103,3-245,86),
(105,3-245,75),
(109,3-245,68),
(103,3-105,92),
(105,3-105,88),
(109,3-105,76),
(101,2-105,64),
(107,3-105,91),
(108,3-105,78),
(101,6-166,85),
(107,6-166,79),
(108,6-166,81);

<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `Teacher` <span class="org-keyword">value</span>
(804,<span class="org-string">'&#26446;&#22478;'</span>,<span class="org-string">'&#30007;'</span>,<span class="org-string">'1958-12-02'</span>,<span class="org-string">'&#21103;&#25945;&#25480;'</span>,<span class="org-string">'&#35745;&#31639;&#26426;&#31995;'</span>),
(856,<span class="org-string">'&#24352;&#26093;'</span>,<span class="org-string">'&#30007;'</span>,<span class="org-string">'1969-03-12'</span>,<span class="org-string">'&#35762;&#24072;'</span>,<span class="org-string">'&#30005;&#23376;&#24037;&#31243;&#31995;'</span>),
(825,<span class="org-string">'&#29579;&#33805;'</span>,<span class="org-string">'&#22899;'</span>,<span class="org-string">'1972-05-05'</span>,<span class="org-string">'&#21161;&#25945;'</span>,<span class="org-string">'&#35745;&#31639;&#26426;&#31995;'</span>),
(831,<span class="org-string">'&#21016;&#20912;'</span>,<span class="org-string">'&#22899;'</span>,<span class="org-string">'1977-08-14'</span>,<span class="org-string">'&#21161;&#25945;'</span>,<span class="org-string">'&#30005;&#23376;&#24037;&#31243;&#31995;'</span>);

</pre>
</div>

<section id="outline-container-org2dec9d1" class="outline-2">
<h2 id="org2dec9d1"><span class="section-number-2">1</span> 查询Student表中的所有记录的Sname、Ssex和Class列</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> `Sname`,`Ssex`,`<span class="org-keyword">Class</span>` <span class="org-keyword">from</span> `Student`;
</pre>
</div>
</div>
</section>


<section id="outline-container-org9aec7bd" class="outline-2">
<h2 id="org9aec7bd"><span class="section-number-2">2</span> 查询教师所有的单位即不重复的Depart列。（多练）</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Depart <span class="org-keyword">from</span> `Teacher`;
</pre>
</div>
</div>
</section>

<section id="outline-container-org4dcc839" class="outline-2">
<h2 id="org4dcc839"><span class="section-number-2">3</span> 查询Student表的所有记录</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Student`;
</pre>
</div>
</div>
</section>

<section id="outline-container-org46a6b07" class="outline-2">
<h2 id="org46a6b07"><span class="section-number-2">4</span> 查询Score表中成绩在60到80之间的所有记录</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Degree &gt;60 <span class="org-keyword">and</span> Degree&lt;80;
<span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Degree <span class="org-keyword">between</span> 60 <span class="org-keyword">and</span> 80;
</pre>
</div>
</div>
</section>

<section id="outline-container-org51af733" class="outline-2">
<h2 id="org51af733"><span class="section-number-2">5</span> 查询Score表中成绩为85，86或88的记录</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Degree = 85  <span class="org-keyword">or</span> Degree =  86 <span class="org-keyword">or</span>  Degree =  88;
<span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Degree <span class="org-keyword">in</span>(85,86,88);
</pre>
</div>
</div>
</section>
