.source/RRRecruit/interview-vol2-db.org
* 查询Student表中“95031”班或性别为“女”的同学记录

#+BEGIN_SRC sql
  select * from `Student` where Class = '95031' or Ssex ='女';
#+END_SRC

* 以Class降序查询Student表的所有记录

#+BEGIN_SRC sql
  select * from `Student` order by Class desc;
#+END_SRC

* 以Cno升序、Degree降序查询Score表的所有记录

#+BEGIN_SRC sql
  select * from `Score` order by Cno asc,Degree desc ;
#+END_SRC

* 查询“95031”班的学生人数

#+BEGIN_SRC sql
  select count(*) from `Student` where Class = '95031';
#+END_SRC

* 查询Score表中的最高分的学生学号和课程号。（子查询或者排序）

#+BEGIN_SRC sql
  select Sno,Cno from `Score` where Degree=(select Max(Degree) from Score);
  select Sno,Cno from `Score` order by Degree desc;
#+END_SRC

* 查询每门课的平均成绩。(group by:根据Cno进行分组)

#+BEGIN_SRC sql
  select Cno,AVG(Degree) as 平均分 from `Score` group by Cno;
#+END_SRC

* 查询Score表中至少有5名学生选修的并以3开头的课程的平均分数

#+BEGIN_SRC sql
  select * from `Score` where Cno like '3%' group by Cno having Count(Cno)>4;
#+END_SRC

* 查询分数大于70，小于90的Sno列

#+BEGIN_SRC sql
  select Sno from `Score` where Degree>70 or Degree<90;
  select Sno from `Score` where Degree between 70 and 90;
#+END_SRC

* 查询所有学生的Sname、Cno和Degree列

#+BEGIN_SRC sql
  select Sname,Cno from `Student` join `Score` on `Student`.Sno = `Score`.Sno;
#+END_SRC

* 查询所有学生的Sno、Cname和Degree列

#+BEGIN_SRC sql
  select Sno,Cname,Degree from Score join Course on Course.Cno = Score.Cno;
#+END_SRC

* 查询所有学生的Sname、Cname和Degree列

#+BEGIN_SRC sql
  select Sname,Cname,Degree from `Student` join Score on
  `Student`.Sno = `Score`.Sno join Course on `Course`.Cno = `Score`.Sno;
#+END_SRC

* 查询“95033”班学生的平均分。(子查询or条件查询)

#+BEGIN_SRC sql
  select AVG(Degree) from  `Score` where Sno in(select Sno from `Student` where Class='95033');

  select Avg(Degree) from `Score`,Student where Student.Sno = Score.Sno and Class = '95033';
#+END_SRC

* 假设使用如下命令建立了一个grade表

#+BEGIN_SRC sql
  create table `grede`(
    `low` int   COMMENT '人名',
    `upp` int not null COMMENT '课长',
    `rank` varchar(20) not null COMMENT '等级'
  );
  insert into `grede` values(90,100,'A');
  insert into `grede` values(80,89,'B');
  insert into `grede` values(70,79,'C');
  insert into `grede` values(60,69,'D');
  insert into `grede` values(0,59,'E');
#+END_SRC

* 现查询所有同学的Sno、Cno和rank列。(between选取两个值之间的数据范围)

#+BEGIN_SRC sql
  select Sno,Cno,Degree,rank from grede join Score on Score.Degree between
      low and upp;

  select Sno,Cno,Degree,rank from  Score,grede where Degree between
      low and upp;

#+END_SRC

* 查询选修“3-105”课程的成绩高于“109”号同学成绩的所有同学的记录

#+BEGIN_SRC sql
  select * from Student,Score where Score.Cno = '3-105' and Student.Sno = Score.Sno
  and Score.Degree>(select Degree from Score where Cno = '3-105' and Sno = '109');
#+END_SRC

* 查询score中选学多门课程的同学中分数为非最高分成绩的记录

#+BEGIN_SRC sql
  select * from Score a where Degree<(select MAX(Degree)from  Score b
  where a.Cno = b.Cno) and Sno in(select Sno from Score group by  Sno having  count(*) > 1);
#+END_SRC

* 查询成绩高于学号为“109”、课程号为“3-105”的成绩的所有记录

#+BEGIN_SRC sql
  select * from Student,Score where Student.Sno = Score.Sno and Score.Degree>
  (select Degree from Score where Cno='3-105' and Sno = '109');
#+END_SRC

