RRRecruit/interview-vol2-db.html

<section id="outline-container-org8d98d79" class="outline-2">
<h2 id="org8d98d79"><span class="section-number-2">6</span> 查询Student表中“95031”班或性别为“女”的同学记录</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Student` <span class="org-keyword">where</span> <span class="org-keyword">Class</span> = <span class="org-string">'95031'</span> <span class="org-keyword">or</span> Ssex =<span class="org-string">'&#22899;'</span>;
</pre>
</div>
</div>
</section>

<section id="outline-container-org943e006" class="outline-2">
<h2 id="org943e006"><span class="section-number-2">7</span> 以Class降序查询Student表的所有记录</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Student` <span class="org-keyword">order</span> <span class="org-keyword">by</span> <span class="org-keyword">Class</span> <span class="org-keyword">desc</span>;
</pre>
</div>
</div>
</section>

<section id="outline-container-org1a22978" class="outline-2">
<h2 id="org1a22978"><span class="section-number-2">8</span> 以Cno升序、Degree降序查询Score表的所有记录</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Score` <span class="org-keyword">order</span> <span class="org-keyword">by</span> Cno <span class="org-keyword">asc</span>,Degree <span class="org-keyword">desc</span> ;
</pre>
</div>
</div>
</section>

<section id="outline-container-org453cb7c" class="outline-2">
<h2 id="org453cb7c"><span class="section-number-2">9</span> 查询“95031”班的学生人数</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> `Student` <span class="org-keyword">where</span> <span class="org-keyword">Class</span> = <span class="org-string">'95031'</span>;
</pre>
</div>
</div>
</section>

<section id="outline-container-org10e895b" class="outline-2">
<h2 id="org10e895b"><span class="section-number-2">10</span> 查询Score表中的最高分的学生学号和课程号。（子查询或者排序）</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Cno <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Degree=(<span class="org-keyword">select</span> <span class="org-builtin">Max</span>(Degree) <span class="org-keyword">from</span> Score);
<span class="org-keyword">select</span> Sno,Cno <span class="org-keyword">from</span> `Score` <span class="org-keyword">order</span> <span class="org-keyword">by</span> Degree <span class="org-keyword">desc</span>;
</pre>
</div>
</div>
</section>

<section id="outline-container-orgf666123" class="outline-2">
<h2 id="orgf666123"><span class="section-number-2">11</span> 查询每门课的平均成绩。(group by:根据Cno进行分组)</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Cno,<span class="org-builtin">AVG</span>(Degree) <span class="org-keyword">as</span> &#24179;&#22343;&#20998; <span class="org-keyword">from</span> `Score` <span class="org-keyword">group</span> <span class="org-keyword">by</span> Cno;
</pre>
</div>
</div>
</section>

<section id="outline-container-org696da58" class="outline-2">
<h2 id="org696da58"><span class="section-number-2">12</span> 查询Score表中至少有5名学生选修的并以3开头的课程的平均分数</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Cno <span class="org-keyword">like</span> <span class="org-string">'3%'</span> <span class="org-keyword">group</span> <span class="org-keyword">by</span> Cno <span class="org-keyword">having</span> <span class="org-builtin">Count</span>(Cno)&gt;4;
</pre>
</div>
</div>
</section>

<section id="outline-container-orgac2f19c" class="outline-2">
<h2 id="orgac2f19c"><span class="section-number-2">13</span> 查询分数大于70，小于90的Sno列</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Degree&gt;70 <span class="org-keyword">or</span> Degree&lt;90;
<span class="org-keyword">select</span> Sno <span class="org-keyword">from</span> `Score` <span class="org-keyword">where</span> Degree <span class="org-keyword">between</span> 70 <span class="org-keyword">and</span> 90;
</pre>
</div>
</div>
</section>

<section id="outline-container-orgdb92105" class="outline-2">
<h2 id="orgdb92105"><span class="section-number-2">14</span> 查询所有学生的Sname、Cno和Degree列</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sname,Cno <span class="org-keyword">from</span> `Student` <span class="org-keyword">join</span> `Score` <span class="org-keyword">on</span> `Student`.Sno = `Score`.Sno;
</pre>
</div>
</div>
</section>

<section id="outline-container-orga1a7075" class="outline-2">
<h2 id="orga1a7075"><span class="section-number-2">15</span> 查询所有学生的Sno、Cname和Degree列</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Cname,Degree <span class="org-keyword">from</span> Score <span class="org-keyword">join</span> Course <span class="org-keyword">on</span> Course.Cno = Score.Cno;
</pre>
</div>
</div>
</section>

<section id="outline-container-orgb7be05f" class="outline-2">
<h2 id="orgb7be05f"><span class="section-number-2">16</span> 查询所有学生的Sname、Cname和Degree列</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sname,Cname,Degree <span class="org-keyword">from</span> `Student` <span class="org-keyword">join</span> Score <span class="org-keyword">on</span>
`Student`.Sno = `Score`.Sno <span class="org-keyword">join</span> Course <span class="org-keyword">on</span> `Course`.Cno = `Score`.Sno;
</pre>
</div>
</div>
</section>

<section id="outline-container-orgfc72885" class="outline-2">
<h2 id="orgfc72885"><span class="section-number-2">17</span> 查询“95033”班学生的平均分。(子查询or条件查询)</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">AVG</span>(Degree) <span class="org-keyword">from</span>  `Score` <span class="org-keyword">where</span> Sno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Sno <span class="org-keyword">from</span> `Student` <span class="org-keyword">where</span> <span class="org-keyword">Class</span>=<span class="org-string">'95033'</span>);

<span class="org-keyword">select</span> <span class="org-builtin">Avg</span>(Degree) <span class="org-keyword">from</span> `Score`,Student <span class="org-keyword">where</span> Student.Sno = Score.Sno <span class="org-keyword">and</span> <span class="org-keyword">Class</span> = <span class="org-string">'95033'</span>;
</pre>
</div>
</div>
</section>

<section id="outline-container-org5126c59" class="outline-2">
<h2 id="org5126c59"><span class="section-number-2">18</span> 假设使用如下命令建立了一个grade表</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> `grede`(
  `low` <span class="org-type">int</span>   COMMENT <span class="org-string">'&#20154;&#21517;'</span>,
  `upp` <span class="org-type">int</span> <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#35838;&#38271;'</span>,
  `rank` <span class="org-type">varchar</span>(20) <span class="org-keyword">not</span> <span class="org-keyword">null</span> COMMENT <span class="org-string">'&#31561;&#32423;'</span>
);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `grede` <span class="org-keyword">values</span>(90,100,<span class="org-string">'A'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `grede` <span class="org-keyword">values</span>(80,89,<span class="org-string">'B'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `grede` <span class="org-keyword">values</span>(70,79,<span class="org-string">'C'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `grede` <span class="org-keyword">values</span>(60,69,<span class="org-string">'D'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> `grede` <span class="org-keyword">values</span>(0,59,<span class="org-string">'E'</span>);
</pre>
</div>
</div>
</section>

<section id="outline-container-org089abc5" class="outline-2">
<h2 id="org089abc5"><span class="section-number-2">19</span> 现查询所有同学的Sno、Cno和rank列。(between选取两个值之间的数据范围)</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Cno,Degree,rank <span class="org-keyword">from</span> grede <span class="org-keyword">join</span> Score <span class="org-keyword">on</span> Score.Degree <span class="org-keyword">between</span>
    low <span class="org-keyword">and</span> upp;

<span class="org-keyword">select</span> Sno,Cno,Degree,rank <span class="org-keyword">from</span>  Score,grede <span class="org-keyword">where</span> Degree <span class="org-keyword">between</span>
    low <span class="org-keyword">and</span> upp;

</pre>
</div>
</div>
</section>

<section id="outline-container-org16b0d38" class="outline-2">
<h2 id="org16b0d38"><span class="section-number-2">20</span> 查询选修“3-105”课程的成绩高于“109”号同学成绩的所有同学的记录</h2>
<div class="outline-text-2" id="text-20">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> Student,Score <span class="org-keyword">where</span> Score.Cno = <span class="org-string">'3-105'</span> <span class="org-keyword">and</span> Student.Sno = Score.Sno
<span class="org-keyword">and</span> Score.Degree&gt;(<span class="org-keyword">select</span> Degree <span class="org-keyword">from</span> Score <span class="org-keyword">where</span> Cno = <span class="org-string">'3-105'</span> <span class="org-keyword">and</span> Sno = <span class="org-string">'109'</span>);
</pre>
</div>
</div>
</section>

<section id="outline-container-org1617588" class="outline-2">
<h2 id="org1617588"><span class="section-number-2">21</span> 查询score中选学多门课程的同学中分数为非最高分成绩的记录</h2>
<div class="outline-text-2" id="text-21">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> Score a <span class="org-keyword">where</span> Degree&lt;(<span class="org-keyword">select</span> <span class="org-builtin">MAX</span>(Degree)<span class="org-keyword">from</span>  Score b
<span class="org-keyword">where</span> a.Cno = b.Cno) <span class="org-keyword">and</span> Sno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Sno <span class="org-keyword">from</span> Score <span class="org-keyword">group</span> <span class="org-keyword">by</span>  Sno <span class="org-keyword">having</span>  <span class="org-builtin">count</span>(*) &gt; 1);
</pre>
</div>
</div>
</section>

<section id="outline-container-orge3963fc" class="outline-2">
<h2 id="orge3963fc"><span class="section-number-2">22</span> 查询成绩高于学号为“109”、课程号为“3-105”的成绩的所有记录</h2>
<div class="outline-text-2" id="text-22">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> Student,Score <span class="org-keyword">where</span> Student.Sno = Score.Sno <span class="org-keyword">and</span> Score.Degree&gt;
(<span class="org-keyword">select</span> Degree <span class="org-keyword">from</span> Score <span class="org-keyword">where</span> Cno=<span class="org-string">'3-105'</span> <span class="org-keyword">and</span> Sno = <span class="org-string">'109'</span>);
</pre>
</div>
</div>
</section>
