.source/RRRecruit/interview-vol2-db.org
* 查询和学号为107的同学同年出生的所有学生的Sno、Sname和Sbirthday列

#+BEGIN_SRC sql
  select Sno,Sname,Sbirthday from student where year(Student.Sbirthday) = (
      select year(Sbirthday) from student where Sno = '107'
      );
#+END_SRC

* 查询“张旭“教师任课的学生成绩

#+BEGIN_SRC sql
  select Sno,Cno,Degree from Score where Cno in(select Cno from Course where
     Tno in(select Tno from Teacher where Tname = '张旭'));
#+END_SRC

* 查询选修某课程的同学人数多于5人的教师姓名

#+BEGIN_SRC sql
  select Tname from Teacher where Tno in(select Tno from Course where Cno in(select Cno from Score
  group by Cno having Count(*)>5));
#+END_SRC


* 查询95033班和95031班全体学生的记录

#+BEGIN_SRC sql
  select * from Student where Class = '95033' or Class = '95031';
#+END_SRC


* 查询存在有85分以上成绩的课程Cno

#+BEGIN_SRC sql
  select distinct cno from Score where Degree>85;
#+END_SRC


* 查询出“计算机系“教师所教课程的成绩表

#+BEGIN_SRC sql
  select Sno,Cno,Degree from Score where Cno in(select Cno from Course where Tno in(
      select tno from Teacher where Depart = '计算机系'
      ));
#+END_SRC


* 查询“计算机系”与“电子工程系“不同职称的教师的Tname和Prof。使用相关子查询

#+BEGIN_SRC sql
  select Tname,Prof from Teacher a where Prof not in(select Prof from Teacher b where
  a.Depart!=b.Depart);
#+END_SRC

* 查询选修编号为“3-105“课程且成绩至少高于选修编号为“3-245”课程的同学的Cno、Sno和Degree,并按Degree从高到低次序排序

#+BEGIN_SRC sql
  select Cno,Sno,Degree from Score a where (select Degree from Score b where Cno='3-105' and
  b.Sno = a.Sno)>=(select Degree from Score c where Cno='3-245' and c.Sno = a.Sno)order by
  Degree desc ;
#+END_SRC


* 查询选修编号为“3-105”课程且成绩高于选修编号为“3-245”课程的同学的Cno、Sno和Degree.

#+BEGIN_SRC sql
  select Cno,Sno,Degree from Score a where (select Degree from Score b where Cno='3-105' and
  b.Sno=a.Sno)>(select Degree from Score c where Cno='3-245' and c.Sno=a.Sno);
#+END_SRC


* 查询所有教师和同学的name、sex和birthday

#+BEGIN_SRC sql
  select distinct Sname as name,Ssex as sex,Sbirthday as birthday from student
  union
  select distinct Tname as name,Tsex as sex,Tbirthday as birthday from Teacher;
#+END_SRC


* 查询所有“女”教师和“女”同学的name、sex和birthday.

#+BEGIN_SRC sql
  select distinct Sname as name,Ssex as sex,Sbirthday as birthday from student where Ssex = '女'
  union
  select distinct Tname as name,Tsex as sex,Tbirthday as birthday from Teacher where Tsex = '女';
#+END_SRC


* 查询成绩比该课程平均成绩低的同学的成绩表

#+BEGIN_SRC sql
  select Sno,Cno,Degree from Score a where  a.Degree<(select AVG(Degree) from Score b where a.Cno = b.Cno);
#+END_SRC


* 查询所有任课教师的Tname和Depart

#+BEGIN_SRC sql
  select Tname,Depart from Teacher where Tname in(select distinct Tname from Teacher,
  Course,Score where Teacher.Tno = Course.Tno and Course.Cno = Score.Cno);

  select Tname,Depart from Teacher where tno in (select tno from course where Cno in (select distinct Cno from Score));
#+END_SRC


* 查询所有未讲课的教师的Tname和Depart

#+BEGIN_SRC sql
  select Tname,Depart from Teacher where Tname not in(select distinct Tname from Teacher,Course,Score where Teacher.Tno=Course.Tno and Course.Cno = Score.Cno);
#+END_SRC

* 查询至少有2名男生的班号

#+BEGIN_SRC sql
  select Class from student where Ssex='男' group by Class having count(*)>1;
#+END_SRC


