RRRecruit/interview-vol2-db.html

<section id="outline-container-org7f0715d" class="outline-2">
<h2 id="org7f0715d"><span class="section-number-2">23</span> 查询和学号为107的同学同年出生的所有学生的Sno、Sname和Sbirthday列</h2>
<div class="outline-text-2" id="text-23">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Sname,Sbirthday <span class="org-keyword">from</span> student <span class="org-keyword">where</span> <span class="org-keyword">year</span>(Student.Sbirthday) = (
    <span class="org-keyword">select</span> <span class="org-keyword">year</span>(Sbirthday) <span class="org-keyword">from</span> student <span class="org-keyword">where</span> Sno = <span class="org-string">'107'</span>
    );
</pre>
</div>
</div>
</section>

<section id="outline-container-org591fcd2" class="outline-2">
<h2 id="org591fcd2"><span class="section-number-2">24</span> 查询“张旭“教师任课的学生成绩</h2>
<div class="outline-text-2" id="text-24">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Cno,Degree <span class="org-keyword">from</span> Score <span class="org-keyword">where</span> Cno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Cno <span class="org-keyword">from</span> Course <span class="org-keyword">where</span>
   Tno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Tno <span class="org-keyword">from</span> Teacher <span class="org-keyword">where</span> Tname = <span class="org-string">'&#24352;&#26093;'</span>));
</pre>
</div>
</div>
</section>

<section id="outline-container-orgd033219" class="outline-2">
<h2 id="orgd033219"><span class="section-number-2">25</span> 查询选修某课程的同学人数多于5人的教师姓名</h2>
<div class="outline-text-2" id="text-25">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Tname <span class="org-keyword">from</span> Teacher <span class="org-keyword">where</span> Tno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Tno <span class="org-keyword">from</span> Course <span class="org-keyword">where</span> Cno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Cno <span class="org-keyword">from</span> Score
<span class="org-keyword">group</span> <span class="org-keyword">by</span> Cno <span class="org-keyword">having</span> <span class="org-builtin">Count</span>(*)&gt;5));
</pre>
</div>
</div>
</section>


<section id="outline-container-orgd1af653" class="outline-2">
<h2 id="orgd1af653"><span class="section-number-2">26</span> 查询95033班和95031班全体学生的记录</h2>
<div class="outline-text-2" id="text-26">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> <span class="org-keyword">Class</span> = <span class="org-string">'95033'</span> <span class="org-keyword">or</span> <span class="org-keyword">Class</span> = <span class="org-string">'95031'</span>;
</pre>
</div>
</div>
</section>


<section id="outline-container-org1a6d7ca" class="outline-2">
<h2 id="org1a6d7ca"><span class="section-number-2">27</span> 查询存在有85分以上成绩的课程Cno</h2>
<div class="outline-text-2" id="text-27">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">distinct</span> cno <span class="org-keyword">from</span> Score <span class="org-keyword">where</span> Degree&gt;85;
</pre>
</div>
</div>
</section>


<section id="outline-container-orga79c5b3" class="outline-2">
<h2 id="orga79c5b3"><span class="section-number-2">28</span> 查询出“计算机系“教师所教课程的成绩表</h2>
<div class="outline-text-2" id="text-28">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Cno,Degree <span class="org-keyword">from</span> Score <span class="org-keyword">where</span> Cno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Cno <span class="org-keyword">from</span> Course <span class="org-keyword">where</span> Tno <span class="org-keyword">in</span>(
    <span class="org-keyword">select</span> tno <span class="org-keyword">from</span> Teacher <span class="org-keyword">where</span> Depart = <span class="org-string">'&#35745;&#31639;&#26426;&#31995;'</span>
    ));
</pre>
</div>
</div>
</section>


<section id="outline-container-org70abc62" class="outline-2">
<h2 id="org70abc62"><span class="section-number-2">29</span> 查询“计算机系”与“电子工程系“不同职称的教师的Tname和Prof。使用相关子查询</h2>
<div class="outline-text-2" id="text-29">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Tname,Prof <span class="org-keyword">from</span> Teacher a <span class="org-keyword">where</span> Prof <span class="org-keyword">not</span> <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Prof <span class="org-keyword">from</span> Teacher b <span class="org-keyword">where</span>
a.Depart!=b.Depart);
</pre>
</div>
</div>
</section>

<section id="outline-container-orge52afbe" class="outline-2">
<h2 id="orge52afbe"><span class="section-number-2">30</span> 查询选修编号为“3-105“课程且成绩至少高于选修编号为“3-245”课程的同学的Cno、Sno和Degree,并按Degree从高到低次序排序</h2>
<div class="outline-text-2" id="text-30">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Cno,Sno,Degree <span class="org-keyword">from</span> Score a <span class="org-keyword">where</span> (<span class="org-keyword">select</span> Degree <span class="org-keyword">from</span> Score b <span class="org-keyword">where</span> Cno=<span class="org-string">'3-105'</span> <span class="org-keyword">and</span>
b.Sno = a.Sno)&gt;=(<span class="org-keyword">select</span> Degree <span class="org-keyword">from</span> Score c <span class="org-keyword">where</span> Cno=<span class="org-string">'3-245'</span> <span class="org-keyword">and</span> c.Sno = a.Sno)<span class="org-keyword">order</span> <span class="org-keyword">by</span>
Degree <span class="org-keyword">desc</span> ;
</pre>
</div>
</div>
</section>


<section id="outline-container-org947a46b" class="outline-2">
<h2 id="org947a46b"><span class="section-number-2">31</span> 查询选修编号为“3-105”课程且成绩高于选修编号为“3-245”课程的同学的Cno、Sno和Degree.</h2>
<div class="outline-text-2" id="text-31">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Cno,Sno,Degree <span class="org-keyword">from</span> Score a <span class="org-keyword">where</span> (<span class="org-keyword">select</span> Degree <span class="org-keyword">from</span> Score b <span class="org-keyword">where</span> Cno=<span class="org-string">'3-105'</span> <span class="org-keyword">and</span>
b.Sno=a.Sno)&gt;(<span class="org-keyword">select</span> Degree <span class="org-keyword">from</span> Score c <span class="org-keyword">where</span> Cno=<span class="org-string">'3-245'</span> <span class="org-keyword">and</span> c.Sno=a.Sno);
</pre>
</div>
</div>
</section>


<section id="outline-container-orgff8970b" class="outline-2">
<h2 id="orgff8970b"><span class="section-number-2">32</span> 查询所有教师和同学的name、sex和birthday</h2>
<div class="outline-text-2" id="text-32">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Sname <span class="org-keyword">as</span> <span class="org-keyword">name</span>,Ssex <span class="org-keyword">as</span> sex,Sbirthday <span class="org-keyword">as</span> birthday <span class="org-keyword">from</span> student
<span class="org-keyword">union</span>
<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Tname <span class="org-keyword">as</span> <span class="org-keyword">name</span>,Tsex <span class="org-keyword">as</span> sex,Tbirthday <span class="org-keyword">as</span> birthday <span class="org-keyword">from</span> Teacher;
</pre>
</div>
</div>
</section>


<section id="outline-container-orgaf384f2" class="outline-2">
<h2 id="orgaf384f2"><span class="section-number-2">33</span> 查询所有“女”教师和“女”同学的name、sex和birthday.</h2>
<div class="outline-text-2" id="text-33">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Sname <span class="org-keyword">as</span> <span class="org-keyword">name</span>,Ssex <span class="org-keyword">as</span> sex,Sbirthday <span class="org-keyword">as</span> birthday <span class="org-keyword">from</span> student <span class="org-keyword">where</span> Ssex = <span class="org-string">'&#22899;'</span>
<span class="org-keyword">union</span>
<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Tname <span class="org-keyword">as</span> <span class="org-keyword">name</span>,Tsex <span class="org-keyword">as</span> sex,Tbirthday <span class="org-keyword">as</span> birthday <span class="org-keyword">from</span> Teacher <span class="org-keyword">where</span> Tsex = <span class="org-string">'&#22899;'</span>;
</pre>
</div>
</div>
</section>


<section id="outline-container-org9d1f036" class="outline-2">
<h2 id="org9d1f036"><span class="section-number-2">34</span> 查询成绩比该课程平均成绩低的同学的成绩表</h2>
<div class="outline-text-2" id="text-34">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Cno,Degree <span class="org-keyword">from</span> Score a <span class="org-keyword">where</span>  a.Degree&lt;(<span class="org-keyword">select</span> <span class="org-builtin">AVG</span>(Degree) <span class="org-keyword">from</span> Score b <span class="org-keyword">where</span> a.Cno = b.Cno);
</pre>
</div>
</div>
</section>


<section id="outline-container-org3b848fe" class="outline-2">
<h2 id="org3b848fe"><span class="section-number-2">35</span> 查询所有任课教师的Tname和Depart</h2>
<div class="outline-text-2" id="text-35">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Tname,Depart <span class="org-keyword">from</span> Teacher <span class="org-keyword">where</span> Tname <span class="org-keyword">in</span>(<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Tname <span class="org-keyword">from</span> Teacher,
Course,Score <span class="org-keyword">where</span> Teacher.Tno = Course.Tno <span class="org-keyword">and</span> Course.Cno = Score.Cno);

<span class="org-keyword">select</span> Tname,Depart <span class="org-keyword">from</span> Teacher <span class="org-keyword">where</span> tno <span class="org-keyword">in</span> (<span class="org-keyword">select</span> tno <span class="org-keyword">from</span> course <span class="org-keyword">where</span> Cno <span class="org-keyword">in</span> (<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Cno <span class="org-keyword">from</span> Score));
</pre>
</div>
</div>
</section>


<section id="outline-container-orgf0e1501" class="outline-2">
<h2 id="orgf0e1501"><span class="section-number-2">36</span> 查询所有未讲课的教师的Tname和Depart</h2>
<div class="outline-text-2" id="text-36">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Tname,Depart <span class="org-keyword">from</span> Teacher <span class="org-keyword">where</span> Tname <span class="org-keyword">not</span> <span class="org-keyword">in</span>(<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> Tname <span class="org-keyword">from</span> Teacher,Course,Score <span class="org-keyword">where</span> Teacher.Tno=Course.Tno <span class="org-keyword">and</span> Course.Cno = Score.Cno);
</pre>
</div>
</div>
</section>

<section id="outline-container-orgfc149af" class="outline-2">
<h2 id="orgfc149af"><span class="section-number-2">37</span> 查询至少有2名男生的班号</h2>
<div class="outline-text-2" id="text-37">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">Class</span> <span class="org-keyword">from</span> student <span class="org-keyword">where</span> Ssex=<span class="org-string">'&#30007;'</span> <span class="org-keyword">group</span> <span class="org-keyword">by</span> <span class="org-keyword">Class</span> <span class="org-keyword">having</span> <span class="org-builtin">count</span>(*)&gt;1;
</pre>
</div>
</div>
</section>
