.source/RRRecruit/interview-vol2-db.org
* 查询Student表中不姓“王”的同学记录

#+BEGIN_SRC sql
  select * from Student where Sname not like ('王%');
#+END_SRC


* 查询Student表中每个学生的姓名和年龄

#+BEGIN_SRC sql
  select Sname,YEAR(GETDATE())-year(Sbirthday) from student;
#+END_SRC


* 查询Student表中最大和最小的Sbirthday日期值

#+BEGIN_SRC sql
  select MAX(Sbirthday) as 最大,MIN(Sbirthday) as 最小 from student;
#+END_SRC


* 以班号和年龄从大到小的顺序查询Student表中的全部记录

#+BEGIN_SRC sql
  select * from Student order by Class desc ,Sbirthday asc;
#+END_SRC


* 查询“男”教师及其所上的课程

#+BEGIN_SRC sql
  select Tname,Cname from Teacher,Course where Tsex='男' and Teacher.Tno = Course.Tno;
#+END_SRC


* 查询最高分同学的Sno、Cno和Degree列

#+BEGIN_SRC sql
  select Sno,Cno,Degree from Score where Degree=(select MAX(Degree) FROM score);
#+END_SRC


* 查询和“李军”同性别的所有同学的Sname.

#+BEGIN_SRC sql
  select SName from Student where Ssex=(select Ssex from Student where Sname='李军')and Sname
  not in ('李军');
#+END_SRC

* 查询和“李军”同性别并同班的同学Sname

#+BEGIN_SRC sql
  select Sname from Student where Ssex=(select Ssex from Student where Sname='李军')and Sname not in
  ('李军')and Class=(select Class from Student where Sname='李军');
#+END_SRC

* 查询所有选修“计算机导论”课程的“男”同学的成绩表

#+BEGIN_SRC sql
  select Sno,Degree from Score where Sno in(select Sno from Student where Ssex='男')and Cno in
  (select Cno from Course where Cname='计算机导论');
#+END_SRC
