RRRecruit/interview-vol2-db.html


<section id="outline-container-org845fb02" class="outline-2">
<h2 id="org845fb02"><span class="section-number-2">38</span> 查询Student表中不姓“王”的同学记录</h2>
<div class="outline-text-2" id="text-38">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> Sname <span class="org-keyword">not</span> <span class="org-keyword">like</span> (<span class="org-string">'&#29579;%'</span>);
</pre>
</div>
</div>
</section>


<section id="outline-container-org3b323da" class="outline-2">
<h2 id="org3b323da"><span class="section-number-2">39</span> 查询Student表中每个学生的姓名和年龄</h2>
<div class="outline-text-2" id="text-39">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sname,<span class="org-keyword">YEAR</span>(GETDATE())-<span class="org-keyword">year</span>(Sbirthday) <span class="org-keyword">from</span> student;
</pre>
</div>
</div>
</section>


<section id="outline-container-orga2c4ecb" class="outline-2">
<h2 id="orga2c4ecb"><span class="section-number-2">40</span> 查询Student表中最大和最小的Sbirthday日期值</h2>
<div class="outline-text-2" id="text-40">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">MAX</span>(Sbirthday) <span class="org-keyword">as</span> &#26368;&#22823;,<span class="org-builtin">MIN</span>(Sbirthday) <span class="org-keyword">as</span> &#26368;&#23567; <span class="org-keyword">from</span> student;
</pre>
</div>
</div>
</section>


<section id="outline-container-orgab33403" class="outline-2">
<h2 id="orgab33403"><span class="section-number-2">41</span> 以班号和年龄从大到小的顺序查询Student表中的全部记录</h2>
<div class="outline-text-2" id="text-41">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> Student <span class="org-keyword">order</span> <span class="org-keyword">by</span> <span class="org-keyword">Class</span> <span class="org-keyword">desc</span> ,Sbirthday <span class="org-keyword">asc</span>;
</pre>
</div>
</div>
</section>


<section id="outline-container-org2e51169" class="outline-2">
<h2 id="org2e51169"><span class="section-number-2">42</span> 查询“男”教师及其所上的课程</h2>
<div class="outline-text-2" id="text-42">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Tname,Cname <span class="org-keyword">from</span> Teacher,Course <span class="org-keyword">where</span> Tsex=<span class="org-string">'&#30007;'</span> <span class="org-keyword">and</span> Teacher.Tno = Course.Tno;
</pre>
</div>
</div>
</section>


<section id="outline-container-orgabd5db8" class="outline-2">
<h2 id="orgabd5db8"><span class="section-number-2">43</span> 查询最高分同学的Sno、Cno和Degree列</h2>
<div class="outline-text-2" id="text-43">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Cno,Degree <span class="org-keyword">from</span> Score <span class="org-keyword">where</span> Degree=(<span class="org-keyword">select</span> <span class="org-builtin">MAX</span>(Degree) <span class="org-keyword">FROM</span> score);
</pre>
</div>
</div>
</section>


<section id="outline-container-org9559dc6" class="outline-2">
<h2 id="org9559dc6"><span class="section-number-2">44</span> 查询和“李军”同性别的所有同学的Sname.</h2>
<div class="outline-text-2" id="text-44">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> SName <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> Ssex=(<span class="org-keyword">select</span> Ssex <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> Sname=<span class="org-string">'&#26446;&#20891;'</span>)<span class="org-keyword">and</span> Sname
<span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-string">'&#26446;&#20891;'</span>);
</pre>
</div>
</div>
</section>

<section id="outline-container-orga8b1b5f" class="outline-2">
<h2 id="orga8b1b5f"><span class="section-number-2">45</span> 查询和“李军”同性别并同班的同学Sname</h2>
<div class="outline-text-2" id="text-45">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sname <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> Ssex=(<span class="org-keyword">select</span> Ssex <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> Sname=<span class="org-string">'&#26446;&#20891;'</span>)<span class="org-keyword">and</span> Sname <span class="org-keyword">not</span> <span class="org-keyword">in</span>
(<span class="org-string">'&#26446;&#20891;'</span>)<span class="org-keyword">and</span> <span class="org-keyword">Class</span>=(<span class="org-keyword">select</span> <span class="org-keyword">Class</span> <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> Sname=<span class="org-string">'&#26446;&#20891;'</span>);
</pre>
</div>
</div>
</section>

<section id="outline-container-org27b36b7" class="outline-2">
<h2 id="org27b36b7"><span class="section-number-2">46</span> 查询所有选修“计算机导论”课程的“男”同学的成绩表</h2>
<div class="outline-text-2" id="text-46">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> Sno,Degree <span class="org-keyword">from</span> Score <span class="org-keyword">where</span> Sno <span class="org-keyword">in</span>(<span class="org-keyword">select</span> Sno <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> Ssex=<span class="org-string">'&#30007;'</span>)<span class="org-keyword">and</span> Cno <span class="org-keyword">in</span>
(<span class="org-keyword">select</span> Cno <span class="org-keyword">from</span> Course <span class="org-keyword">where</span> Cname=<span class="org-string">'&#35745;&#31639;&#26426;&#23548;&#35770;'</span>);
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: unname</p>
<p class="date">Created: 2019-03-26 周二 01:36</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
